In [1]:
#importing all the libraries
import pandas as pd
import sqlite3

#installing ipython-sql library 
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /Users/sushantkumbhar/opt/anaconda3/lib/python3.8/site-packages (0.4.0)
Requirement already satisfied: six in /Users/sushantkumbhar/opt/anaconda3/lib/python3.8/site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in /Users/sushantkumbhar/opt/anaconda3/lib/python3.8/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable<1 in /Users/sushantkumbhar/opt/anaconda3/lib/python3.8/site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: sqlparse in /Users/sushantkumbhar/opt/anaconda3/lib/python3.8/site-packages (from ipython-sql) (0.4.1)
Requirement already satisfied: ipython>=1.0 in /Users/sushantkumbhar/opt/anaconda3/lib/python3.8/site-packages (from ipython-sql) (7.19.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in /Users/sushantkumbhar/opt/anaconda3/lib/python3.8/site-packages (from ipython-sql) (1.3.20)
Requirement already satisfied: backcall in /Users/sushantkumbhar/opt/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in /Users/sushantkumbhar/opt/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: traitlets>=4.2 in /Users/sushantkumbhar/opt/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (5.0.5)
Requirement already satisfied: setuptools>=18.5 in /Users/sushantkumbhar/opt/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (50.3.1.post20201107)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /Users/sushantkumbhar/opt/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (3.0.8)
Requirement already satisfied: pexpect>4.3; sys_platform != "win32" in /Users/sushantkumbhar/opt/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: jedi>=0.10 in /Users/sushantkumbhar/opt/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (0.17.1)
Requirement already satisfied: pickleshare in /Users/sushantkumbhar/opt/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: pygments in /Users/sushantkumbhar/opt/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (2.7.2)
Requirement already satisfied: appnope; sys_platform == "darwin" in /Users/sushantkumbhar/opt/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (0.1.0)
Requirement already satisfied: wcwidth in /Users/sushantkumbhar/opt/anaconda3/lib/python3.8/site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: ptyprocess>=0.5 in /Users/sushantkumbhar/opt/anaconda3/lib/python3.8/site-packages (from pexpect>4.3; sys_platform != "win32"->ipython>=1.0->ipython-sql) (0.6.0)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in /Users/sushantkumbhar/opt/anaconda3/lib/python3.8/site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.7.0)

In [2]:
df1 = pd.read_csv(r'/Users/sushantkumbhar/Documents/Stevens Academics/Skills Imporvement/SQL/SQL practice/Day_05_Practice/Dataset/Dataset_05_city.csv')
df2 = pd.read_csv(r'/Users/sushantkumbhar/Documents/Stevens Academics/Skills Imporvement/SQL/SQL practice/Day_05_Practice/Dataset/Dataset_05_country.csv')

cnn = sqlite3.connect('Problem_set_05.db')

df1.to_sql('city',cnn)
df2.to_sql('country',cnn)

%load_ext sql

%sql sqlite:///Problem_set_05.db

In [15]:
%%sql

SELECT * 
FROM city 
INNER JOIN country
ON city.COUNTRYCODE = country.CODE
LIMIT 2;

 * sqlite:///Problem_set_05.db
Done.

[(0, 4, 'Mazar-e-Sharif', 'AFG', 'Balkh', 127800, 16, 'AFG', 'Afghanistan', 'Asia', 'Southern and Central Asia', 652090, 1919.0, 22720000, 45.9, 5976, None, 'Afganistan/Afqanestan', 'Islamic Emirate', 'Mohammad Omar', 1.0, 'AF'),
 (0, 4, 'Mazar-e-Sharif', 'AFG', 'Balkh', 127800, 17, 'AFG', 'Afghanistan', 'Asia', 'Southern and Central Asia', 652090, 1919.0, 22720000, 45.9, 5976, None, 'Afganistan/Afqanestan', 'Islamic Emirate', 'Mohammad Omar', 1.0, 'AF')]

In [16]:
%%sql

SELECT * FROM city LIMIT 2;

 * sqlite:///Problem_set_05.db
Done.

[(0, 4, 'Mazar-e-Sharif', 'AFG', 'Balkh', 127800),
 (1, 4, 'Mazar-e-Sharif', 'AFG', 'Balkh', 127800)]

In [17]:
%%sql

SELECT * FROM country LIMIT 2;

 * sqlite:///Problem_set_05.db
Done.

[(0, 'ABW', 'Aruba', 'North America', 'Caribbean', 193, None, 103000, 78.4, 828, 793.0, 'Aruba', 'Nonmetropolitan Territory of The Netherlands', 'Beatrix', 129.0, 'AW'),
 (1, 'ABW', 'Aruba', 'North America', 'Caribbean', 193, None, 103000, 78.4, 828, 793.0, 'Aruba', 'Nonmetropolitan Territory of The Netherlands', 'Beatrix', 129.0, 'AW')]

##  Problem 1: Given the CITY and COUNTRY tables, query the sum of the populations of all cities where the CONTINENT is 'Asia'.

In [23]:
%%sql

SELECT SUM(city.POPULATION) AS Total_Asia_Population
FROM city
INNER JOIN country
ON city.COUNTRYCODE = country.CODE
WHERE CONTINENT = 'Asia';

 * sqlite:///Problem_set_05.db
Done.

[(2594734464,)]

## Problem 2: Given the CITY and COUNTRY tables, query the names of all cities where the CONTINENT is 'Africa'.

In [30]:
%%sql

SELECT DISTINCT(city.Name) AS African_cities # Using Distinct to limit the result size ;p
FROM city
INNER JOIN country
ON city.COUNTRYCODE = country.CODE
WHERE CONTINENT = 'Africa';

 * sqlite:///Problem_set_05.db
Done.

[('Qina',),
 ('Warraq al-Arab',),
 ('Libreville',),
 ('Alberton',),
 ('Brakpan',),
 ('Kempton Park',),
 ('Klerksdorp',),
 ('Uitenhage',)]

##  Problem 3: Given the CITY and COUNTRY tables, query the names of all the continents (COUNTRY.Continent) and their respective average city populations (CITY.Population) rounded down to the nearest integer.

In [32]:
%%sql

SELECT DISTINCT(country.CONTINENT), AVG(city.POPULATION) AS Avg_Population
FROM city
JOIN country
ON city.COUNTRYCODE = country.CODE
GROUP BY country.CONTINENT;

 * sqlite:///Problem_set_05.db
Done.

[('Africa', 274439.0),
 ('Asia', 693038.0512820513),
 ('Europe', 175138.3),
 ('Oceania', 109189.66666666667),
 ('South America', 147435.2)]

##  Problem 4: Query the POPULATION and GNP of the country where GNP is maximum.

In [37]:
%%sql

SELECT POPULATION, GNP
FROM country
GROUP BY GNP
ORDER BY GNP DESC
LIMIT 1;

 * sqlite:///Problem_set_05.db
Done.

[(278357000, 8510700)]

##  Problem 5: Query the POPULATION and GNP of the country where GNP is minimum.

In [40]:
%%sql

SELECT POPULATION, GNP
FROM country
GROUP BY GNP
ORDER BY GNP 
LIMIT 1;

 * sqlite:///Problem_set_05.db
Done.

[(600, 0)]

##  Problem 6: Query the CODE of the country having most LIFEEXPECTANCY.

In [43]:
%%sql

SELECT DISTINCT(CODE), LIFEEXPECTANCY
FROM country
WHERE LIFEEXPECTANCY = (SELECT MAX(LIFEEXPECTANCY) FROM country);

 * sqlite:///Problem_set_05.db
Done.

[('AND', 83.5)]

##  Problem 7: Query the CODE and GNP of the largest COUNTRY.

In [45]:
%%sql

SELECT DISTINCT(CODE), GNP
FROM country
WHERE SURFACEAREA = (SELECT MAX(SURFACEAREA) From country);

 * sqlite:///Problem_set_05.db
Done.

[('RUS', 276608)]

##  Problem 8: Query the NAME and GNP of the most populated COUNTRY.

In [57]:
%%sql

SELECT DISTINCT(CODE), GNP,
CASE WHEN CODE = 'IND' THEN 'India' END AS Name
FROM country
WHERE POPULATION = (SELECT MAX(POPULATION) FROM country);

 * sqlite:///Problem_set_05.db
Done.

[('IND', 447114, 'India')]